In [1]:
import pandas as pd

import sqlalchemy
from sqlalchemy import create_engine
db_string = "postgresql://wbauer_adb:adb2020@pgsql-196447.vipserv.org:5432/wbauer_adb"

db = create_engine(db_string)
connection_sqlalchemy = db.connect()

**Zadanie 1**

Znajdź wszystkie nazwy krajów rozpoczynających się na P.

In [2]:
c1 = pd.read_sql("select country from country where country LIKE 'P%'", con=connection_sqlalchemy)
c1

       country
0     Pakistan
1     Paraguay
2         Peru
3  Philippines
4       Poland
5  Puerto Rico

**Zadanie 2**

Znajdź wszystkie nazwy krajów rozpoczynających się P i kończących na s.

In [3]:
c2 = pd.read_sql("select country from country where country LIKE 'P%s'", con=connection_sqlalchemy)
c2

       country
0  Philippines

**Zadanie 3**

Znajdź wszystkie tytuły filmów, w których znajdują się cyfry.

In [4]:
f1 = pd.read_sql("select title from film where title SIMILAR TO '%[0-9]%'", con=connection_sqlalchemy)
f1

Empty DataFrame
Columns: [title]
Index: []

**Zadanie 4**

Znajdź wszystkich pracowników z podwójnym imieniem lub nazwiskiem.

In [5]:
staff = pd.read_sql("select first_name, last_name from staff where first_name SIMILAR TO '% %' or last_name SIMILAR TO '%-%' or last_name SIMILAR TO '% %'", con=connection_sqlalchemy)
staff

Empty DataFrame
Columns: [first_name, last_name]
Index: []

**Zadanie 5**

Znajdź wszystkie nazwiska aktorów rozpoczynających się od P lub C i mających 5 znaków.

In [6]:
actors = pd.read_sql("select last_name from actor where last_name LIKE 'P____' or last_name LIKE 'C____' ", con=connection_sqlalchemy)
actors

  last_name
0     Chase
1     Posey
2     Pesci
3     Crowe
4     Chase
5     Close

**Zadanie 6**

Znajdź wszystkie tytuły filmów, w których występują słowa Trip lub Alone.

In [7]:
titles = pd.read_sql("select title from film where title ILIKE '%Trip%' or title ILIKE '%Alone%' ", con=connection_sqlalchemy)
titles

           title
0     Alone Trip
1  Superfly Trip
2    Trip Newton
3   Varsity Trip

**Zadanie 7**

Przeanalizuj zapytania:

**1)** select first_name from actor where first_name ~ '^ Al[a: z, 1: 9] *'

**2)** first_name from actor where first_name ~ '^ al[a: z, 1: 9] '

**1)**

~ :pasuje do wzorca , wielkość liter ma znaczenie

^ :dopasuje od początku łańcucha znaków "Al"

następnie może być dowolna litera od a do z, dowolna liczba od 1 do 9

'*' :sekwencja 0 lub więcej dopasowań atomu

In [8]:
a1 = pd.read_sql("select first_name from actor where first_name ~ '^Al[a:z, 1:9]*'", con=connection_sqlalchemy)
a1

  first_name
0       Alec
1     Albert
2     Albert
3         Al
4       Alan

**2)**

~* :pasuje do wzorca , wielkość liter nie ma znaczenia

^ :dopasuje od początku łańcucha znaków "al"

następnie może być dowolna litera od a do z, dowolna liczba od 1 do 9

'*' :sekwencja 0 lub więcej dopasowań atomu

In [9]:
a2 = pd.read_sql("select first_name from actor where first_name ~* '^al[a:z, 1:9]*'", con=connection_sqlalchemy)
a2

  first_name
0       Alec
1     Albert
2     Albert
3         Al
4       Alan

**Wniosek:**

Oba zapytania szukają w bazie imion aktorów, imię zaczynające się na "Al" lub "al", gdzie w prypadku "al" - wielkość liter nie ma znaczenia (dla "Al" miały znaczenie), dlatego powstał ten sam wynik

# **Zadanie implementacyjne**

Zaimplementuj wszystkie funkcje w pliku main.py zgodnie z opisem a następnie przetestuj je w notatniku.

In [10]:
import main
import test_main

!pytest -q test_main.py

..........................                                               [100%]
============================== warnings summary ===============================
..\anaconda3\lib\site-packages\pyreadline\py3k_compat.py:8
  C:\Users\Dell\anaconda3\lib\site-packages\pyreadline\py3k_compat.py:8: DeprecationWarning: Using or importing the ABCs from 'collections' instead of from 'collections.abc' is deprecated since Python 3.3, and in 3.9 it will stop working
    return isinstance(x, collections.Callable)

-- Docs: https://docs.pytest.org/en/stable/warnings.html
26 passed, 1 warning in 3.60s

In [11]:
#main.film_title_case_insensitive(['BeD', 'BLOOD', 'SonS', 'son', 'cry'])
main.film_title_case_insensitive(["Giant", "Harry", "Birdcage", "Iron"])

                title
0     Birdcage Casper
1      Chocolat Harry
2      Giant Troopers
3         Harry Idaho
4   Hoosiers Birdcage
5           Iron Moon
6          Jaws Harry
7    Kentuckian Giant
8     Louisiana Harry
9      Princess Giant
10    Whisperer Giant

In [12]:
main.film_in_category("Action")

                     title               languge category
0             Amadeus Holy  English                Action
1          American Circus  English                Action
2       Antitrust Tomatoes  English                Action
3            Ark Ridgemont  English                Action
4      Barefoot Manchurian  English                Action
..                     ...                   ...      ...
59         Uprising Uptown  English                Action
60  Waterfront Deliverance  English                Action
61           Werewolf Lola  English                Action
62            Women Dorado  English                Action
63            Worst Banger  English                Action

[64 rows x 3 columns]

In [13]:
main.film_in_category(1)

                     title               languge category
0             Amadeus Holy  English                Action
1          American Circus  English                Action
2       Antitrust Tomatoes  English                Action
3            Ark Ridgemont  English                Action
4      Barefoot Manchurian  English                Action
..                     ...                   ...      ...
59         Uprising Uptown  English                Action
60  Waterfront Deliverance  English                Action
61           Werewolf Lola  English                Action
62            Women Dorado  English                Action
63            Worst Banger  English                Action

[64 rows x 3 columns]

In [14]:
main.film_in_category_case_insensitive("ACTION")

                     title               languge category
0             Amadeus Holy  English                Action
1          American Circus  English                Action
2       Antitrust Tomatoes  English                Action
3            Ark Ridgemont  English                Action
4      Barefoot Manchurian  English                Action
..                     ...                   ...      ...
59         Uprising Uptown  English                Action
60  Waterfront Deliverance  English                Action
61           Werewolf Lola  English                Action
62            Women Dorado  English                Action
63            Worst Banger  English                Action

[64 rows x 3 columns]

In [15]:
main.film_in_category_case_insensitive(1)

                     title               languge category
0             Amadeus Holy  English                Action
1          American Circus  English                Action
2       Antitrust Tomatoes  English                Action
3            Ark Ridgemont  English                Action
4      Barefoot Manchurian  English                Action
..                     ...                   ...      ...
59         Uprising Uptown  English                Action
60  Waterfront Deliverance  English                Action
61           Werewolf Lola  English                Action
62            Women Dorado  English                Action
63            Worst Banger  English                Action

[64 rows x 3 columns]

In [16]:
main.film_cast("Princess Giant")

  first_name last_name
0  Christian    Akroyd
1      Meryl    Gibson
2         Ed   Guiness
3       Adam    Hopper
4   Humphrey    Willis